# Задание 1: Типы переменных
"""Создай переменные следующих типов:
целое число
дробное число
строка
булево значение
список
и выведи их типы с помощью type()."""

# Ответ:
age = 31
height = 1.75
last_name = 'Kulov'
human = True
food_like = ['nuttella', 'plov', 'pizza']

print(type(age))
print(type(height))
print(type(last_name))
print(type(human))
print(type(food_like))
